{
  "basics": {
    "name": "Paula Amaya",
    "email": "hello@paulaamaya.com",
    "label": "Software Developer"
  },
  "work": [
    {
      "name": "University of Calgary",
      "location": "Calgary, AB",
      "position": "Undergraduate Research Assistant",
      "startDate": "2025-05-01",
      "endDate": "2025-08-22",
      "highlights": ["Develop machine learning models to improve the selection and tuning of numerical integrators for solving ordinary differential equations in physical simulations.", 
      "Build classification models to select optimal integration methods and regression models to fine-tune their parameters.",
      "Evaluate models against hand-tuned baselines for runtime and accuracy on simulated physics datasets."]
    },
    {
      "name": "River Valley School",
      "location": "Calgary, AB",
      "position": "Information Technology Analyst Intern",
      "startDate": "2024-05-01",
      "endDate": "2024-08-20",
      "highlights": ["Led pilot implementation of Jira Service Management (JSM) from inception to rollout and training.", 
      "Developed custom data wrangling middleware to integrate PowerSchool SIS with in-house analytics dashboards.",
      "Conducted a database cleanup initiative, overseeing the mass update of staff records while maintaining cross-system data integrity."]
    },
    {
      "name": "Wave Financial",
      "location": "Toronto, ON",
      "position": "Risk Strategy Intern",
      "startDate": "2022-05-01",
      "endDate": "2022-08-20",
      "highlights": ["Planned, developed, and delivered database documentation for 15+ tables stored in an Amazon Redshift data warehouse.", 
      "Developed 10+ SQL functions to generate periodic database triggers used in various reports.",
      "Created a real-time analytics dashboard using Python, Numpy, and Pyplot containing 20+ metrics related to the company's most profitable payments line of business."]
    }
  ],
  "volunteer": [
    {
      "organization": "University of Calgary Solar Car Team",
      "location": "Calgary, AB",
      "position": "Embedded Systems Developer",
      "startDate": "2023-09-10",
      "endDate": "2024-08-15",
      "highlights": ["Collaborated with a team of developers and engineers to design and implement software for electronic control systems using a C/C++ development environment.", 
      "Developed documentation detailing Battery Management System functionality and best practices for incorporating its data-gathering features into the vehicle's analytics ecosystem."]
    },
    {
      "organization": "Electronic Recycling Association",
      "location": "Calgary, AB",
      "position": "Computer Technician",
      "startDate": "2025-05-10",
      "endDate": "2025-08-20",
      "highlights": ["Disassemble, test, and refurbish computer hardware including RAM, HDDs, CPUs, and power supplies.", 
      "Perform system diagnostics and monitoring tests on donated devices. Strip non-functional systems for reusable parts."]
    }
  ],
  "education": [
    {
      "institution": "University of Toronto",
      "area": "Computer Science & Mathematics",
      "studyType": "Honours Bachelor of Science"
    }
  ],
  "awards": [
    {
      "title": "Diversity in Mathematical Sciences 2024",
      "date": "2024-07-29",
      "awarder": "The Fields Institute for Research in Mathematical Sciences",
      "url": "http://www.fields.utoronto.ca/activities/24-25/IDMS-2024",
      "summary": "Awarded funding to participate in a commutative algebra program at Dalhousie University, collaborating with students and faculty from North America."
    },
    {
      "title": "NSERC Undergraduate Student Research Award",
      "date": "2025-05-01",
      "awarder": "Natural Sciences and Engineering Research Council of Canada",
      "summary": "Awarded funding to research machine learning-guided optimization of numerical integrators for simulating physical systems, under the supervision of Dr. Adam Runions."
    }
  ],
  "skills": [
    {
      "name": "Languages",
      "icon": "fa-solid fa-code",
      "keywords": [
        "matplotlib",
        "Java",
        "Python",
        "SQL"
      ]
    },
    {
      "name": "Libraries",
      "icon": "fa-solid fa-cubes",
      "keywords": [
        "C/C++",
        "Java",
        "Python",
        "SQL"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent"
    },
    {
      "language": "Spanish",
      "fluency": "Fluent"
    }
  ]
}
